Revit 2026 API

# VoltageTypeSetErase Method

---

Removes a specified voltage type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	VoltageType item
)
```
```vb
Public Overridable Function Erase (
	item As VoltageType
) As Integer
```
```cpp
public:
virtual int Erase(
	VoltageType^ item
)
```
```fsharp
abstract Erase :
        item : VoltageType -> int
override Erase :
        item : VoltageType -> int
```

#### Parameters

item VoltageType
    The voltage type to be erased.

#### Return Value

Int32The number of voltage types that were erased from the set.

#### Reference

VoltageTypeSet Class

Autodesk.Revit.DB.Electrical Namespace